snlkuharlocal/src/Documents/СчетФактураНаАванс/СчетФактураНаАванс.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>СчетФактураНаАванс</name>
  <basedOn>Document.ПоступлениеНаРасчетныйСчет</basedOn>
  <basedOn>Document.ПриходныйКассовыйОрдер</basedOn>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидСчетаФактуры</name>
    <type>
      <types>EnumRef.ВидСчетаФактурыВыставленного</types>
    </type>
  </attributes>
  <attributes>
    <name>Выставлен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ГлавныйБухгалтер</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВыставления</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаДокументаАвансаКомитента</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИсправляемогоКорректировочногоДокумента</name>
    <comment>Дата исправляемого корректировочного счета-фактуры</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИсходногоДокумента</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПлатежноРасчетногоДокумента</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.Договоры</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.РасходныйКассовыйОрдер</types>
      <types>DocumentRef.КорректировкаЗадолженности</types>
      <types>DocumentRef.Взаимозачет</types>
      <types>DocumentRef.ПриходныйКассовыйОрдер</types>
      <types>DocumentRef.КорректировкаЦенВНакладной</types>
      <types>DocumentRef.АвансовыйОтчет</types>
      <types>DocumentRef.ДвиженияДенежныхСредств</types>
      <types>DocumentRef.РекламационнаяНакладная</types>
      <types>DocumentRef.ПоступлениеНаРасчетныйСчет</types>
      <types>DocumentRef.ОплатаПлатежнойКартой</types>
    </type>
  </attributes>
  <attributes>
    <name>Исправление</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсправляемыйСчетФактура</name>
    <type>
      <types>DocumentRef.СчетФактураНаАванс</types>
    </type>
  </attributes>
  <attributes>
    <name>КодВидаОперации</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодВидаОперацииНаУменьшение</name>
    <comment>Код вида операции при уменьшении стоимости (количества)</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодСпособаВыставления</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комитент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>КППКонтрагента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КПППродавца</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерДокументаАвансаКомитента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерИсправления</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерИсправляемогоКорректировочногоДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерИсходногоДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерПлатежноРасчетногоДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредставлениеНомера</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>32</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Продавец</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Руководитель</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>СтавкаНДС</name>
    <type>
      <types>EnumRef.СтавкиНДС</types>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <comment>Сумма с НДС</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <comment>Сумма по документу основанию в валюте документа</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаНДС</name>
    <comment>Сумма НДС</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаНДСДокумента</name>
    <comment>Сумма НДС по документу основанию в валюте документа</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>14</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаНДСУвеличение</name>
    <comment>Сумма НДС по документу-основанию в валюте документа увеличение</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>14</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаНДСУменьшение</name>
    <comment>Сумма НДС по документу основанию в валюте документа уменьшение</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>14</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаУвеличение</name>
    <comment>Сумма по документу-основанию в валюте документа увеличение</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>14</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаУменьшение</name>
    <comment>Сумма по документу-основанию в валюте документа уменьшение</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>14</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СчетРасчетов</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетФактураБезНДС</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетФактураНеВыставляется</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Авансы</name>
    <attributes>
      <name>Контрагент</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Содержание</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1000</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>14</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <type>
        <types>EnumRef.СтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>14</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДокументОснование</name>
      <type>
        <types>DocumentRef.РасходныйКассовыйОрдер</types>
        <types>DocumentRef.КорректировкаЗадолженности</types>
        <types>DocumentRef.Взаимозачет</types>
        <types>DocumentRef.ПриходныйКассовыйОрдер</types>
        <types>DocumentRef.КорректировкаЦенВНакладной</types>
        <types>DocumentRef.РекламационнаяНакладная</types>
        <types>DocumentRef.ПоступлениеНаРасчетныйСчет</types>
        <types>DocumentRef.ОплатаПлатежнойКартой</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаПлатежноРасчетногоДокумента</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерПлатежноРасчетногоДокумента</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>30</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерСчетаФактурыПродавца</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаДоКорректировки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>14</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДСДоКорректировки</name>
      <type>
        <types>EnumRef.СтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДСДоКорректировки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>14</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КорректируемыйСчетФактура</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПлатежноРасчетныеДокументы</name>
    <attributes>
      <name>ДатаДокумента</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерДокумента</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>30</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

snlkuharlocal/src/Enums/ВидСчетаФактурыВыставленного/ВидСчетаФактурыВыставленного.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидСчетаФактурыВыставленного</name>
  <enumValues>
    <name>НаАванс</name>
  </enumValues>
  <enumValues>
    <name>НаАвансКомитента</name>
  </enumValues>
  <enumValues>
    <name>НаАвансКомитентаНаЗакупку</name>
  </enumValues>
  <enumValues>
    <name>КорректировочныйНаАванс</name>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Documents/СчетФактураНаАванс/ObjectModule.bsl
#Область СобытияДокумента

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	ТипДанныхЗаполнения = ТипЗнч(ДанныеЗаполнения);	
	
	Дата 	= ТекущаяДата();	
	Валюта	= ОбщегоНазначения_ПИ.ВалютаНац();	
	Автор	= ПараметрыСеанса.Пользователь;
	
	мДокОснование = Неопределено;
	Если ТипДанныхЗаполнения = Тип("Структура") Тогда
		мДокОснование 	= МаркировкаКС.ПолучитьЗначениеПараметра(ДанныеЗаполнения, "ДокОснование");
		Сумма			= МаркировкаКС.ПолучитьЗначениеПараметра(ДанныеЗаполнения, "Сумма");
		СтавкаНДС		= МаркировкаКС.ПолучитьЗначениеПараметра(ДанныеЗаполнения, "СтавкаНДС", Перечисления.СтавкиНДС.СтавкаНДСПоУмолчанию(Дата));
	ИначеЕсли Документы.ТипВсеСсылки().СодержитТип(ТипДанныхЗаполнения) Тогда
		мДокОснование = ДанныеЗаполнения;		
	КонецЕсли;	
	
	ДокументОснование   = мДокОснование;
	
	ТипОснования = ТипЗнч(ДокументОснование);
	
	Если ТипОснования = Тип("ДокументСсылка.ПоступлениеНаРасчетныйСчет") Тогда		
		Сумма = ПолучитьСуммаАвансаПоПП(ДокументОснование);
	Иначе                                                  
		Сумма = ПолучитьСуммаАвансаПоРегистратору(ДокументОснование);		
	КонецЕсли;
	
	ТипОснования = ТипЗнч(мДокОснование);	
	
	Если ТипОснования = Тип("ДокументСсылка.ПоступлениеНаРасчетныйСчет") Тогда
		ДокументОснование	= мДокОснование;
		
		ВидСчетаФактуры		= Перечисления.ВидСчетаФактурыВыставленного.НаАванс;		
		
		рШапки = ПолучитьРеквизитыШапки(ДокументОснование, "Дата,Организация,Контрагент,Договор,НомерВходящегоДокумента,ДатаВходящегоДокумента");
		
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, рШапки);	
		
		НомерПлатежноРасчетногоДокумента	= рШапки.НомерВходящегоДокумента;
		ДатаПлатежноРасчетногоДокумента		= рШапки.ДатаВходящегоДокумента;
	ИначеЕсли ТипОснования = Тип("ДокументСсылка.ПриходныйКассовыйОрдер") Тогда
		ДокументОснование	= мДокОснование;
		
		ВидСчетаФактуры		= Перечисления.ВидСчетаФактурыВыставленного.НаАванс;		
		
		рШапки = ПолучитьРеквизитыШапки(ДокументОснование, "Дата,Организация,Контрагент,Договор,Номер");
		
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, рШапки);	
		
		НомерПлатежноРасчетногоДокумента	= рШапки.Номер;
		ДатаПлатежноРасчетногоДокумента		= рШапки.Дата;	
		// Кухарь А.Ю. 09.06.2026 начало     
		//Наряд 0000001116
	ИначеЕсли ТипОснования = Тип("ДокументСсылка.РекламационнаяНакладная") Тогда
		ДокументОснование	= мДокОснование;	
		
		рШапки = ПолучитьРеквизитыШапки(ДокументОснование, "Корреспондент,Договор");
		
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, рШапки);
		Контрагент = рШапки.Корреспондент;
		// Кухарь А.Ю. 09.06.2026 конец		
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(СтавкаНДС) Тогда
		СтавкаНДС	= Перечисления.СтавкиНДС.СтавкаНДСПоУмолчанию(Дата);		
	КонецЕсли;
		
	ПроцентНДС	= 100*ПроцентНДСпоСтавке(СтавкаНДС); //Вот такая волшебная функция
	СуммаНДС 	= Сумма*ПроцентНДС/(100 + ПроцентНДС);
	
	Авансы.Очистить();
		
	СтрокаА = Авансы.Добавить();
	
	СтрокаА.ДокументОснование   = ДокументОснование;
	СтрокаА.Контрагент 			= Контрагент;
	СтрокаА.СтавкаНДС			= СтавкаНДС;
	СтрокаА.Сумма				= Сумма;
	СтрокаА.СуммаНДС	 		= СуммаНДС;
	СтрокаА.Содержание			= "Предоплата";
	
	СтрокаА.НомерПлатежноРасчетногоДокумента	= НомерПлатежноРасчетногоДокумента;
	СтрокаА.ДатаПлатежноРасчетногоДокумента		= ДатаПлатежноРасчетногоДокумента;		
	
	ПлатежноРасчетныеДокументы.Очистить();
	
	СтрокаПРД = ПлатежноРасчетныеДокументы.Добавить();                           
	
	СтрокаПРД.НомерДокумента	= НомерПлатежноРасчетногоДокумента;
	СтрокаПРД.ДатаДокумента		= ДатаПлатежноРасчетногоДокумента;
	
	Выставлен   	= Истина;       
	ДатаВыставления = Дата;
	
	ОтветственныеЛица = ОтветственныеЛица(Организация, Дата);
	
	Руководитель		= МаркировкаКС.ПолучитьЗначениеПараметра(ОтветственныеЛица, "Руководитель");
	ГлавныйБухгалтер	= МаркировкаКС.ПолучитьЗначениеПараметра(ОтветственныеЛица, "ГлавныйБухгалтер");	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если Модифицированность() Тогда
		ДатаИзменения = ТекущаяДата();
		
		Сумма 		= Авансы.Итог("Сумма");		
		СуммаНДС	= Авансы.Итог("СуммаНДС");
	КонецЕсли;
	Если ЭтоНовый() Тогда
		ДатаСоздания = ТекущаяДата();	
	КонецЕсли;
КонецПроцедуры

Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)
	Если ЗначениеЗаполнено(Организация) Тогда
		Префикс = СокрЛП(Организация.Префикс);
	КонецЕсли;
	Префикс = Символ(КодСимвола("A") + Число(Прав(""+Год(ТекущаяДата()), 1)-1)) + "-" + Формат(Дата, "ДФ=ММдд") + "-";
КонецПроцедуры //ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)

#КонецОбласти

Функция ПолучитьСуммаАвансаПоПП(ППВход)
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	СУММА(Взаиморасчеты.СуммаВал) КАК Сумма	
	|ИЗ
	|	РегистрНакопления.ВзаиморасчетыПоДокументамРасчетов КАК Взаиморасчеты
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ 
	|	Документ.ПоступлениеНаРасчетныйСчет КАК ППВход
	|ПО 
	|	Взаиморасчеты.Регистратор 			= ППВход.ДокОснование
	|	И Взаиморасчеты.ДокументРасчетов	= ППВход.Ссылка		 
	|ГДЕ
	|	ППВход.Ссылка = &ППВход
	|	И Взаиморасчеты.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	И Взаиморасчеты.СуммаВал > 0	
	|";
	
	Запрос.УстановитьПараметр("ППВход", ППВход);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Результат = 0;
	Если Выборка.Следующий() И ЗначениеЗаполнено(Выборка.Сумма) Тогда
		Результат = Выборка.Сумма;	
	КонецЕсли;                     
	
	Возврат Результат;
КонецФункции //ПолучитьСуммаАвансаПоПП(ППВход)

Функция ПолучитьСуммаАвансаПоРегистратору(Регистратор)
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	СУММА(СуммаВал) КАК Сумма	
	|ИЗ
	|	РегистрНакопления.ВзаиморасчетыПоДокументамРасчетов	
	|ГДЕ	
	|	Регистратор = &Регистратор
	|	И ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	И СуммаВал > 0	
	|";
	
	Запрос.УстановитьПараметр("Регистратор", Регистратор);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Результат = 0;
	Если Выборка.Следующий() И ЗначениеЗаполнено(Выборка.Сумма) Тогда
		Результат = Выборка.Сумма;	
	КонецЕсли;                     
	
	Возврат Результат;
КонецФункции //ПолучитьСуммаАвансаПоРегистратору(ПКО)

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	НеПроверяемыеРеквизиты = Новый Массив;
	
	Если Исправление Тогда
		ПроверяемыеРеквизиты.Добавить("НомерИсправления");
		
		ПроверяемыеРеквизиты.Добавить("НомерИсходногоДокумента");
		ПроверяемыеРеквизиты.Добавить("ДатаИсходногоДокумента");		
	КонецЕсли;		
КонецПроцедуры
